Revit 2027 API
Stairs.GetStairsSupports Method
 Returns all the stairs support components in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetStairsSupports()
Public Function GetStairsSupports As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetStairsSupports()
member GetStairsSupports : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
Example
private void GetStairSupports(Stairs stairs)
{
    ICollection<ElementId> supportIds = stairs.GetStairsSupports();
    string info = "Number of supports:  " + supportIds.Count;
    int supportIndex = 0;
    foreach (ElementId supportId in supportIds)
    {
        supportIndex++;
        Element support = stairs.Document.GetElement(supportId);
        if (null != support)
        {
            info += "\nName of support " + supportIndex + ":  " + support.Name;
        }
    }
    TaskDialog.Show("Revit", info);
}
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace